# Определение системы уравнений в матричной форме
a11 = 1
a12 = 1
a13 = 1
a14 = 1
a25 = 1
a15 = 1
a21 = 1
a22 = 1
a23 = 1
a24 = 1
a31 = 1
a32 = 1
a33 = 1
a34 = 1
a35 = 1
a41 = 1
a42 = 1
a43 = 1
a44 = 1
a45 = 1
a51 = 1
a52 = 1
a53 = 1
a54 = 1
a55 = 1
b1 = 2
b2 = 3
b3 = 4
b4 = 5
b5 = 9
A = [[a11, a12, a13, a14, a15],
     [a21, a22, a23, a24, a25],
     [a31, a32, a33, a34, a35],
     [a41, a42, a43, a44, a45],
     [a51, a52, a53, a54, a55]]

b = [b1, b2, b3, b4, b5]

# Приведение матрицы коэффициентов к ступенчатому виду
for i in range(len(A)):
    # Деление первой строки на a11
    div = A[i][i]
    for j in range(len(A[i])):
        A[i][j] /= div
    b[i] /= div

    # Вычитание первой строки, умноженной на aij/a11, из всех последующих строк
    for k in range(i + 1, len(A)):
        mult = A[k][i]
        for j in range(len(A[k])):
            A[k][j] -= mult * A[i][j]
        b[k] -= mult * b[i]

# Обратный ход метода Гаусса для получения решения системы
x = [0] * len(A)
for i in range(len(A) - 1, -1, -1):
    x[i] = b[i]
    for j in range(i + 1, len(A)):
        x[i] -= A[i][j] * x[j]
